#include <stdio.h> 

int main() {
    int A, B, C, D, E, F, G; // ประกาศตัวแปรฟังชัน

    A = -2 + 5 * 2;
    printf("A = -2 + 5 * 2;      => A = %d\n", A); // (5x2)+3 = 8

    
    B = 10 / 2 * 3;
    printf("B = 10 / 2 * 3;      => B = %d\n", B); // (10/2)*3 = 15

   
    C = 6 / 2 + 3 * (4 % 2);
    printf("C = 6 / 2 + 3 * (4 %% 2); => C = %d\n", C); // (6/2)+(3x(4%2)) = 6

    
    D = (5 + 2) * 15 % 4;
    printf("D = (5+2) * 15 %% 4;  => D = %d\n", D); // ((5+2)x15)%4 = 1

    
    E = 6 + 2 * 2 - 6 / 2;
    printf("E = 6 + 2 * 2 - 6 / 2; => E = %d\n", E); // 6+(2x2)-(6/2) = 8

    
    F = 5 + 3 * 2 - 8 / 4 + (6 % 5);
    printf("F = 5 + 3 * 2 - 8 / 4 + (6 %% 5); => F = %d\n", F); // 5+(3x2)-(8/4)+(6%5) = 10

   
    G = (4 + 3) * 2 - 10 / (2 + 3);
    printf("G = (4 + 3) * 2 - 10 / (2 + 3); => G = %d\n", G); // ((4+3)x2)-(10/(2+3)) = 13

    return 0; // คืนค่า 0 เพื่อบ่งชี้ว่าการทำงานสำเร็จ
}